
/*
Spanish localizable Strings for "PlcObject" table name
*/

/* PlcCommsObject */

"CommsObjectDataError" = "Se encontró un error en los datos recibidos";
"CommsObjectReachabilityError" = "No se puede acceder al dispositivo remoto porque el dispositivo no se encuentra conectado a una WIFI local o a Internet";
"LowLevelErrorFormatStr" = "Comunicación con el PLC rota debido a un error (%@ %d)";
"HighLevelErrorFormatStr" = "Error de conexión: \"%@\"";
"NetDB_8" = "La dirección del PLC no se ha especificado o no es conocida" ;

/* PlcProtocol subclasses */

"ValidationFailureHeader" = "Fallo de Validación: %@" ;
"FoundAPLCValidationWrong" = "El tag de validación (\"%@\") se leyó del Controlador pero la verificación falló. Código incorrecto";

/* Siemens */


"kPlcTagS7ErrTagConnectionFailure" = "El Controlador aceptó una conexión pero falló la negociación de la longitud de PDU" ;

"kPlcTagS7ErrPDUError" = "El controlador S7 reportó un error de PDU para este tag" ;
"kPlcTagS7ErrPDUDataError" = "El controlador S7 reportó un error de Datos PDU para este tag" ;
"kPlcTagS7ErrNoPeripheralAtAddress" = "No hay datos del módulo E/S o es inaccesible" ;
"kPlcTagS7ErrMultipleBitsNotSupported" = "Lectura de multiples bits no esta soportado por la CPU" ;
"kPlcTagS7ErrItemNotAvailable" = "EL PLC reportó item no disponible para el tag \"%@\"" ;
"kPlcTagS7ErrAddressOutOfRange" = "Acceso más alla del final de datos \"%@\"" ;
"kPlcTagS7ErrWriteDataSizeMismatch" = "Error del tamaño de datos en escritura" ;

/* EthernetIP */

"kPlcTagEIPErrUnknownNativeTag2" = "Se ha encontrado un Controlador pero no tiene el tag \"SMValidationTag\" de tipo INT requerido";
"kPlcTagEIPErrUnknownPcccTag2" = "Se ha encontrado un Controlador SLC/Micrologix pero no tiene el tag \"N98:0\" de tipo INT requerido";
"kPlcTagEIPErrUnknownSegmentPath2" = "Una sesión E/IP se registró en el dispositivo remoto pero no soporta el tag de validación (¿PLC incorrecto?)" ;
"kPlcTagEIPErrServiceNotSupported" = "Una sesión E/IP se registró en el dispositivo remoto pero no soporta los servicios requeridos (¿PLC incorrecto?)" ;
"kPlcTagEIPErrConnectionFailure" = "Una sesión E/IP se registró en el dispositivo remoto pero no se pudo alcanzar un Controlador (¿Numero de slot incorrecto?)" ;
"kPlcTagEIPCIPFwdOpenTimeout" = "Una sesión E/IP se registró en el dispositivo remoto pero el intento de conectar no recibió respuesta (Camino incorrecto al controlador)" ;
"kPlcTagEIPRegisterSessionTimeout" = "Un enlace TCP/IP se estableció pero el intento de registrar sesión E/IP no recibió respuesta (Ethernet/IP no soportado)" ;

"kPlcTagEIPErrUnknownSegmentPath" = "El PLC reportó un error para el tag \"%@\" o no lo reconoció";
"kPlcTagEIPErrPartialDataTransfer" = "El PLC reportó overflow en buffer de respuesta para el tag \"%@\"";
"kPlcTagEIPErrUnknownNativeTag" = "El Logix Controller reportó un error para el tag \"%@\" o no lo encontró";
"kPlcTagEIPErrUnknownPcccTag" = "El SLC/Micrologix Controller reportó un error para el tag \"%@\" o no lo encontró";
/*"kPlcTagErrConnectionFailure" = "Fallo de conexión con Logix Controller" ;*/
"kPlcTagEIPErrConnectionFailure" = "Una sesión E/IP se registró en el dispositivo remoto pero no se pudo alcanzar un Controlador (¿Numero de slot incorrecto?)" ;

"kPlcTagEIPErrAccessBeyoundBounds" = "Acceso más alla del final del tag \"%@\"" ;
"kPlcTagEIPErrTagTypeMismatch" = "El tipo del tag \"%@\" no se corresponde con el tag encontrado en el Logix Controller";


/* Modbus */

"kPlcTagErrModbError" = "El Controlador Modbus reportó un error";
"kPlcTagErrModbIllegalFunction" = "Función no soportada en Controlador Modbus";
"kPlcTagErrModbIllegalDataAddress" = "Dirección Modbus no soportada o fuera de límites (excepción modbus 02)";
"kPlcTagErrModbIllegalDataValue" = "El Controlador Modbus reportó error en el comando (excepción modbus 03)";
"kPlcTagErrModbGatewayPathUnavailable" = "Ruta no disponible en el Gateway Modbus (excepción modbus 0A)";
"kPlcTagErrModbGatewayTargetFailed" = "Dispositivo de destino en el Gateway Modbus no responde (excepción modbus 0B)";


/* Omron */

"kPlcTagErrOmronFinsError" = "El Controlador Omron reportó un error para el tag \"%@\"";

/* Mitsubishi */

"kPlcTagErrMitsubishiError" = "El Controlador Mitsubishi reportó un error para el tag \"%@\"";
"kPlcTagErrMitsubishiError50h" = "El Controlador Mitsubishi reportó el error 50h para el tag \"%@\" (ver FX3U-ENET manual)";
"kPlcTagErrMitsubishiError54h" = "El Controlador Mitsubishi reportó el error 54h para el tag \"%@\" (ver FX3U-ENET manual)";
"kPlcTagErrMitsubishiError56h" = "El Controlador Mitsubishi reportó el error 56h para el tag \"%@\" (ver FX3U-ENET manual)";
"kPlcTagErrMitsubishiError57h" = "El Controlador Mitsubishi reportó el error 57h para el tag \"%@\" (ver FX3U-ENET manual)";
"kPlcTagErrMitsubishiError58h" = "El Controlador Mitsubishi reportó el error 58h para el tag \"%@\" (ver FX3U-ENET manual)";
"kPlcTagErrMitsubishiError5Bh" = "El Controlador Mitsubishi reportó el error 5Bh para el tag \"%@\" (ver FX3U-ENET manual)";
"kPlcTagErrMitsubishiError60h" = "El Controlador Mitsubishi reportó el error 60h para el tag \"%@\" (ver FX3U-ENET manual)";


/* Opto */

"kPlcTagOPFOPowerUpClearError" = "Power-Up-Clear Error, %@";
"kPlcTagOPFOErrDefinitionUnknown" = "PAC Control Engine reported an error for tag \"%@\". Definition Unknown (-1)";
"kPlcTagOPFOErrPortLocked" = "Port Locked (-17)";
"kPlcTagOPFOErrUndefinedObject" = "PAC Control Engine reported an error for tag \"%@\". Undefined Object (-28)";
"kPlcTagOPFOErrPortLocked2" = "Port Locked (-40)";
"kPlcTagOPFOErrNullPointer" = "NULL Pointer Error (-69)";
"kPlcTagOPFOErrInvalidTableIndex" = "Access out of bounds for tag \"%@\". Invalid Table Index (-12)";
"kPlcTagOPFOErrUnespecified" = "Unespecified Error";

/* PlcDevice */

"Default Setting" = "Ajuste predeterminado" ;
"(not provided)" = "(no especificado)" ;
"No Protocol Defined" = "Protocolo No Definido" ;
"Undefined" = "Indefinido" ;
"Yes" = "Sí";
"No" = "No";
"Protocol" = "Protocolo";
"Local IP" = "IP Local";
"Remote" = "Remoto";

/* PlcTagElement */

"kPlcTagErrNone" = "OK";


"kPlcTagErrMalformedBcdTag" = "El Controlador suministró un valor BCD malformado o erróneo";
"kPlcTagErrTagProviderError" = "Error en el Tag Provider, ver la pestaña de Conexiones" ;
"kPlcTagErrUnknownStringEncoding"= "El Controlador suministró una string con codificacion desconocida" ;

"kPlcTagErrLiteVersionTagLimit" = "Este tag está mas allá del número máximo soportado por esta versión de la aplicación. Usa la versión completa para tags ilimitados" ;

"kPlcTagErrWrongValidationTag" = "Tag de Validación desconocido o no soportado";
"kPlcTagErrTypeNotSupported" = "Tipo de dato desconocido o no soportado";
"kPlcTagErrAreaNotSupported" = "Area de memoria desconocida o no soportada";
"kPlcTagErrArrayTypeNotSupported" = "Los tipos de datos no escalares no pueden mostrarse";
"kPlcTagErrSizeNotSupported" = "El tamaño del dato es demasiado grande o no soportado";
/*"kPlcTagErrInvalidArrayAccess" = "Los vectores deben estar alineados con los elementos del area de memoria" ;*/
"kPlcTagErrInvalidArrayAccess" = "Acceso desalineado a datos. Comprueba la correspondencia entre el tipo de dato y el area de memoria" ;
"kPlcTagErrZeroArrayLength" = "Vector de longitud zero" ;
"kPlcTagErrIntersectsValidationTag" = "No se mostrará este tag porque potencialmente se solapa con el tag de validación";
"kPlcTagScalingError" = "Los atributos de escalado para este tag son erróneos o no pueden utilizarse" ;
"kPlcTagInvalidCharacterInFormatString" = "Carácter no válido en la cadena de formato" ;

"kPlcTagErrUnknown" = "Error en Tag" ;
